ai-dl.enlighter
albymor.increment-selection
alefragnani.bookmarks
anseki.vscode-color
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
bierner.markdown-mermaid
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dorianmassoulier.repomix-runner
eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
fwcd.kotlin
golang.go
hollowtree.vue-snippets
ionic.ionic
jnbt.vscode-rufo
johnpapa.vscode-peacock
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
mtxr.sqltools
nuxt.mdc
oracle.oracle-java
postman.postman-for-vscode
rebornix.ruby
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
tamasfe.even-better-toml
techer.open-in-browser
vue.volar
wingrunr21.vscode-ruby
withfig.fig
yzhang.markdown-all-in-one
