albymor.increment-selection
alefragnani.bookmarks
amazonwebservices.amazon-q-vscode
anseki.vscode-color
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
dart-code.dart-code
eamodio.gitlens
foxundermoon.shell-format
golang.go
hollowtree.vue-snippets
ionic.ionic
johnpapa.vscode-peacock
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
nuxt.mdc
nuxtr.nuxtr-vscode
postman.postman-for-vscode
redhat.vscode-xml
ritwickdey.liveserver
saoudrizwan.claude-dev
techer.open-in-browser
vue.volar
withfig.fig
